<?php

/*
=============================================================================
 Файл: donbot.php (frontend) версия 1.1
-----------------------------------------------------------------------------
 Автор: Фомин Александр Алексеевич, mail@mithrandir.ru
-----------------------------------------------------------------------------
 Сайт поддержки: http://alaev.info/blog/post/4481
-----------------------------------------------------------------------------
 Назначение: вывод метатега для закрытия страницы от индексации
=============================================================================
*/

    // Получение и обработка конфирурации модуля
    $tag    = $tag == 'follow'?'follow':'nofollow';
    $pages  = !empty($pages)?$pages:array();
    $conf   = explode(',', $pages);
    
    // Переменная для вывода
    $output = '';
    
    // Массив - шаблон метатега
    $template = array(
        'nofollow' => '<meta name="robots" content="noindex,nofollow" />',
        'follow'   => '<meta name="robots" content="noindex,follow" />',
    );
    
    // Определяем страницу пагинации, где бы мы не находились
    $cstart = intval($_GET['cstart']);
    
    // Если нужно закрыть все страницы пагинации независимо от модуля, сразу выводим нужный тег
    if($cstart > 0 && in_array('pages', $conf))
    {
        $output = $template[$tag];
    }
    
    else
    {
        // Проверяем наличие в конфигурации пунктов, на которые влияет страница пагинации
        switch($dle_module)
        {
            // Пагинация главной страницы
            case 'main':
                if(in_array('mainp', $conf) && $cstart > 1)
                {
                    $output = $template[$tag];
                    break;
                }

            // Пагинация категорий
            case 'cat':
                if(in_array('catp', $conf) && $cstart > 1)
                {
                    $output = $template[$tag];
                    break;
                }
                
            // Если данный dle_module содержится в конфигурации модуля, возвращаем шаблон тега, указанный в параметре
            default:
                if(in_array($dle_module, $conf))
                {
                    $output = $template[$tag];
                }
                break;
        }
    }

    // Вывод нужного тега
    echo $output;

?>